# Aufgaben 4, 7, 8

Bibs

In [2]:
import pandas as pd
import os
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

Daten laden

In [3]:
url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'
file = 'data/titanic_2_original.pickle' # Damit es local gespeichert wird

if os.path.exists(file):
    t = pd.read_pickle(file)
else:
    t = pd.read_csv(url)
    t.to_pickle(file)
t.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
380,381,1,1,"Bidois, Miss. Rosalie",female,42.00,0,0,PC 17757,227.5250,NaN,C
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.00,0,0,113786,30.5000,C104,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
103,104,0,3,"Johansson, Mr. Gustaf Joel",male,33.00,0,0,7540,8.6542,NaN,S
236,237,0,2,"Hold, Mr. Stephen",male,44.00,1,0,26707,26.0000,NaN,S
85,86,1,3,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",female,33.00,3,0,3101278,15.8500,NaN,S
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.00,0,1,24160,211.3375,B5,S
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.00,0,0,111240,33.5000,B19,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.00,1,1,WE/P 5735,71.0000,B22,S

### Aufgabe 4 BINS
4.1. Lösen Sie das Beispiel aus der Vorlesung ohne die Methode pd.cut() zu
verwenden.

In [4]:
import pandas as pd

def age_to_class(age):
    """
    Konvertiert ein Alter in eine Altersklasse.

    Parameter:
    age (int oder float): Das Alter, das konvertiert werden soll.

    Rückgabe:
    str: Die entsprechende Altersklasse.
    """
    if age <= 12: return 'child'
    if age <= 18: return 'teenager'
    if age <= 18: return 'worker'
    if age <= 18: return 'elder'
    return pd.NA

# Angenommen, wir haben einen DataFrame 'df' mit einer Spalte 'Age'
df = pd.DataFrame({'Age': [5, 15, 30, 70, 120, -5]})

# Anwenden der Funktion mit map()
df['Age class map'] = df['Age'].map(age_to_class)

# Anwenden der Funktion mit apply()
df['Age class apply'] = df['Age'].apply(age_to_class)

print(df)

   Age Age class map Age class apply
0    5         child           child
1   15      teenager        teenager
2   30          <NA>            <NA>
3   70          <NA>            <NA>
4  120          <NA>            <NA>
5   -5         child           child

4.2. Wir modifizieren die Anforderung leicht, so dass nun zwei Spalten als Input für <br>
die Funktion verwendet werden. Anstelle ‚adult‘ wollen wir ‚male‘ / ‚female‘ <br>
entsprechend des „Sex“ stehen haben.

In [5]:
import pandas as pd

def age_and_sex_to_class(row):
    """
    Konvertiert Alter und Geschlecht in eine Altersklasse.

    Parameter:
    row (Series): Eine Zeile des DataFrame, die 'Age' und 'Sex' enthält.

    Rückgabe:
    str: Die entsprechende Altersklasse.
    """
    age, sex = row['Age'], row['Sex']
    if age >= 0 and age <= 12: return 'child'
    if age > 12 and age <= 18: return 'teenager'
    if age > 18 and age <= 65 and sex == 'male': return 'adult,'+ 'male'
    if age > 18 and age <= 65 and sex == 'female': return 'adult,'+ 'female'
    if age > 65 and age <= 100: return 'elder'
    else:
        return pd.NA


# Anwenden der Funktion mit apply()
t['Age class'] = t.apply(age_and_sex_to_class, axis=1)

print(t['Age class'])

0        adult,male
1      adult,female
2      adult,female
3      adult,female
4        adult,male
           ...
886      adult,male
887    adult,female
888            <NA>
889      adult,male
890      adult,male
Name: Age class, Length: 891, dtype: object

### 4.3. Bins anhand von Quartilen (qcut())

a) Teilen Sie die „Fare“ in die vier Quartile ein. Benennen Sie die Quartile sinnvoll („billig“,
„normal“,..). <br> Das Ergebnis sollte eine Spalte im titanic-Datensatz sein, welches das
entsprechende Quartil enthält.

In [6]:
# Namen für Bins
bins = ['billig', 'normal', 'teuer', 'sehr teuer']
(t["Fare_Bins"],bins) = pd.qcut(t["Fare"], 4, labels=bins, retbins=True)

t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age class,Fare_Bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"adult,male",billig
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"adult,female",sehr teuer
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"adult,female",normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"adult,female",sehr teuer
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"adult,male",normal

b) Wie sind die Quartile definiert (was sind die oberen und unteren Grenzen der „Fare“
jedes Quartils?

Das erste Quartil (billig) umfasst Werte von der niedrigsten 'Fare' bis zum 25. Perzentil. <br>
Das zweite Quartil (normal) reicht vom 25. Perzentil bis zum Median (50. Perzentil). <br>
Das dritte Quartil (teuer) erstreckt sich vom Median bis zum 75. Perzentil. <br>
Das vierte Quartil (sehr teuer) umfasst Werte vom 75. Perzentil bis zur höchsten 'Fare'.

Andere Antwort

In [7]:
print(bins)

[  0.       7.9104  14.4542  31.     512.3292]

c) Was ist der Median von „Fare“?

In [8]:
t['Fare'].median()

14.4542

d) Wiederholen Sie die Aufgabe, aber nun getrennt nach „Pclass“.

In [9]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age class,Fare_Bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"adult,male",billig
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"adult,female",sehr teuer
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"adult,female",normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"adult,female",sehr teuer
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"adult,male",normal

In [10]:
t_group = t.groupby(by=['Pclass'])

In [11]:
t_group.groups.keys()

dict_keys([1, 2, 3])

In [12]:
first_class =t_group.get_group(1)
seccond_class = t_group.get_group(2)
third_class = t_group.get_group(3)

a) wdh

In [13]:
t.groupby(by="Pclass")["Fare"].apply(lambda s: pd.qcut(s, 4))

/var/folders/vr/klm94mws7lsd0vj7h5gd2bqw0000gn/T/ipykernel_15364/3287942039.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  t.groupby(by="Pclass")["Fare"].apply(lambda s: pd.qcut(s, 4))

0        (-0.001, 7.75]
1        (60.287, 93.5]
2          (7.75, 8.05]
3      (30.924, 60.287]
4          (7.75, 8.05]
             ...
886      (-0.001, 13.0]
887    (-0.001, 30.924]
888       (15.5, 69.55]
889    (-0.001, 30.924]
890      (-0.001, 7.75]
Name: Fare, Length: 891, dtype: interval

In [14]:
#def qcut_bins(g):
#    class, bins = pd.qcut(g,4,retbins=True)
#    return bins

In [15]:
# Namen für Bins
bins = ['billig', 'normal', 'teuer', 'sehr teuer']
(first_class["Fare_Bins"], bins_fclass) = pd.qcut(t["Fare"], 4, labels=bins, retbins=True)
(seccond_class["Fare_Bins"], bins_sclass) = pd.qcut(t["Fare"], 4, labels=bins, retbins=True)
(third_class["Fare_Bins"], bins_tclass) = pd.qcut(t["Fare"], 4, labels=bins, retbins=True)

b)

In [16]:
print(f'First class: {bins_fclass}')
print(f'First class: {bins_sclass}')
print(f'First class: {bins_tclass}')

First class: [  0.       7.9104  14.4542  31.     512.3292]
First class: [  0.       7.9104  14.4542  31.     512.3292]
First class: [  0.       7.9104  14.4542  31.     512.3292]

c) wdh

In [17]:
first_class["Fare"].median()

60.287499999999994

In [18]:
seccond_class["Fare"].median()

14.25

In [19]:
third_class["Fare"].median()

8.05

### 4.4. Alleine oder mit Familie?

a) Berechnen Sie eine Spalte „Alone“, die anzeigt, ob ein Passagier allein gereist ist oder
mit Familie. <br> Familie würde bedeuten, dass entweder Bruder / Schwester / Ehefrau /
Ehemann oder Eltern / Kinder mit an Bord waren.

In [20]:
# Berechne die 'Alone'-Spalte
# Ein Passagier ist allein, wenn sowohl 'SibSp' als auch 'Parch' gleich 0 sind
t['Alone'] = ((t['SibSp'] == 0) & (t['Parch'] == 0)).astype(int)

In [21]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age class,Fare_Bins,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"adult,male",billig,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"adult,female",sehr teuer,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"adult,female",normal,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"adult,female",sehr teuer,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"adult,male",normal,1

b) Wie könnte man die Korrektheit dieser Information in den Daten überprüfen?

Man könnte den Nachnamen von Personen mit Familienmitgliedern auf Duplikate prüfen. Bsp. Ehemann/Frau haben i.d.R. gleichen Nachnamen

### Aufgabe 7 NULL
7.1. Detect <br>
a) Geben sie alle Passagiere aus, für die die Altersangabe fehlt.

In [22]:
no_age = t[t["Age"].isna()]
print(no_age)

     PassengerId  Survived  Pclass                                      Name  \
5              6         0       3                          Moran, Mr. James
17            18         1       2              Williams, Mr. Charles Eugene
19            20         1       3                   Masselmani, Mrs. Fatima
26            27         0       3                   Emir, Mr. Farred Chehab
28            29         1       3             O'Dwyer, Miss. Ellen "Nellie"
..           ...       ...     ...                                       ...
859          860         0       3                          Razi, Mr. Raihed
863          864         0       3         Sage, Miss. Dorothy Edith "Dolly"
868          869         0       3               van Melkebeke, Mr. Philemon
878          879         0       3                        Laleff, Mr. Kristo
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

        Sex  Age  SibSp  Parch      Ticket     Fare Cabin Embarked Age class  \
5      male  NaN      0      0      330877   8.4583   NaN        Q      <NA>
17     male  NaN      0      0      244373  13.0000   NaN        S      <NA>
19   female  NaN      0      0        2649   7.2250   NaN        C      <NA>
26     male  NaN      0      0        2631   7.2250   NaN        C      <NA>
28   female  NaN      0      0      330959   7.8792   NaN        Q      <NA>
..      ...  ...    ...    ...         ...      ...   ...      ...       ...
859    male  NaN      0      0        2629   7.2292   NaN        C      <NA>
863  female  NaN      8      2    CA. 2343  69.5500   NaN        S      <NA>
868    male  NaN      0      0      345777   9.5000   NaN        S      <NA>
878    male  NaN      0      0      349217   7.8958   NaN        S      <NA>
888  female  NaN      1      2  W./C. 6607  23.4500   NaN        S      <NA>

      Fare_Bins  Alone
5        normal      1
17       normal      1
19       billig      1
26       billig      1
28       billig      1
..          ...    ...
859      billig      1
863  sehr teuer      0
868      normal      1
878      billig      1
888       teuer      0

[177 rows x 15 columns]

b)Wie viele

In [23]:
t["Age"].isna().sum()

177

c) Wie viele Werte sind jeweils für jede andere Spalte Null?

In [24]:
t.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age class      177
Fare_Bins        0
Alone            0
dtype: int64

d) Wie viele Zeilen haben in irgendeiner Spalte eine Null?

In [25]:
t.isna().any(axis=1).sum()

708

7.2. Deal with <br>
a) Ersetzen Sie die fehlenden Alterswerte durch den Median aller Passagiere.

In [26]:
# Berechne den Median des Alters
age_median = t['Age'].median()

In [27]:
# Ersetze fehlende Alterswerte durch den Median
t['Age'].fillna(age_median, inplace=True)

In [28]:

# Überprüfe, ob es noch fehlende Werte in der 'Age'-Spalte gibt
print(t['Age'].isna().sum())
print(age_median)

177
28.0

b) Ersetzen Sie die fehlenden Alterswerte durch den Mittelwert in der jeweiligen P-Klasse.

In [29]:
# Berechne den Mittelwert des Alters für jede Passagierklasse
mean_age_by_pclass = t.groupby('Pclass')['Age'].transform('median')

# Ersetze fehlende Alterswerte durch den Mittelwert in der jeweiligen Pclass
t['Age'].fillna(mean_age_by_pclass, inplace=True)

# Überprüfe, ob es noch fehlende Werte in der 'Age'-Spalte gibt
print(t['Age'].isnull().sum())

177

In [30]:
# Andere Lösung
#def fill_mean(g):
#    return g["Age"].fillna(g["Age"].mean())

# fill_mean = lambda g,col: g[col].fillna(g[col].mean())

# t.groupby(by='Pclass').apply(fill_mean)

c) Löschen Sie alle Passagiere mit unbekanntem „Embarked“. <br>
d) Wie viele Zeilen wurden gelöscht?

In [31]:
# Anzahl der Zeilen vor dem Löschen
embarked_len = len(t)

# Lösche alle Zeilen, in denen 'Embarked' NaN ist
t.dropna(subset=['Embarked'], inplace=True)

# Anzahl der Zeilen nach dem Löschen
no_embarked_len = len(t)

rows_lost = embarked_len-no_embarked_len

print(f"Anzahl der gelöschten Zeilen: {rows_lost}")

Anzahl der gelöschten Zeilen: 2

### Aufgabe 8 <br>
a) Extrahieren Sie die Nachnamen

In [32]:
# Extrahiere Nachnamen
t['LastName'] = t['Name'].apply(lambda name: name.split(',')[0])

# Anzeigen der ersten paar Zeilen zur Überprüfung
print(t[['Name', 'LastName']].head())

                                                Name   LastName
0                            Braund, Mr. Owen Harris     Braund
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                             Heikkinen, Miss. Laina  Heikkinen
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                           Allen, Mr. William Henry      Allen

In [33]:
t["last_name"] = t["Name"].str.extract(r'^(.+),')
t.sample(3)[["Name", "last_name"]]

                                                  Name   last_name
137                        Futrelle, Mr. Jacques Heath    Futrelle
503                     Laitinen, Miss. Kristina Sofia    Laitinen
53   Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...  Faunthorpe

c) Berechnen Sie für die Nachnamen die Soundex-Werte

In [34]:
import soundex

In [35]:
# Extrahiere Nachnamen
t['LastName'] = t['Name'].apply(lambda name: name.split(',')[0])

# Initialisiere Soundex-Instanz
soundex_instance = soundex.Soundex()

# Berechne Soundex-Werte
t['Soundex'] = t['LastName'].apply(lambda x: soundex_instance.soundex(x))

# Anzeigen der ersten paar Zeilen zur Überprüfung
print(t[['LastName', 'Soundex']].head())

    LastName Soundex
0     Braund    B653
1    Cumings     C52
2  Heikkinen     H25
3   Futrelle    F364
4      Allen     A45

In [36]:
#t["soundex"] = t["last_name"].map(soundex)
#t.sample(3)[["Name", "soundex"]]

 Untersuchen Sie Passagiere mit identischem Soundex, um Duplikate zu finden (das kann
man mit einem Join machen). Die Ergebnismenge muss weiter eingeschränkt werden,
z.B. indem man das Geschlecht oder die Ticket Nummer berücksichtigt.
Finden Sie ein echtes Duplikat?

In [37]:
# Initialisiere Soundex-Instanz und extrahiere Nachnamen
soundex_instance = soundex.Soundex()
t['Soundex'] = t['LastName'].apply(lambda x: soundex_instance.soundex(x))

# Führe einen Self-Join auf dem DataFrame basierend auf dem Soundex-Code durch
# und schließe zusätzliche Kriterien wie Geschlecht und Ticketnummer ein
duplikate = pd.merge(t, t, on=['Soundex'], suffixes=('_left', '_right'))
duplikate = duplikate[(duplikate['Sex_left'] == duplikate['Sex_right']) & 
                      (duplikate['Ticket_left'] == duplikate['Ticket_right']) &
                      (duplikate['LastName_left'] != duplikate['LastName_right'])]

# Überprüfe die Ergebnisse
print(duplikate[['Name_left', 'Name_right', 'Soundex', 'Sex_left', 'Ticket_left']])

           Name_left      Name_right Soundex Sex_left Ticket_left
1604   Ling, Mr. Lee  Lang, Mr. Fang     L52     male        1601
1607  Lang, Mr. Fang   Ling, Mr. Lee     L52     male        1601

In [38]:
dup = t[["Soundex", "Sex"]].duplicated(keep=False)
t.loc[dup].sort_values(by=["Soundex", "Sex"])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age class,Fare_Bins,Alone,LastName,last_name,Soundex
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,"adult,female",sehr teuer,0,Asplund,Asplund,A21453
233,234,1,3,"Asplund, Miss. Lillian Gertrud",female,5.0,4,2,347077,31.3875,NaN,S,child,sehr teuer,0,Asplund,Asplund,A21453
182,183,0,3,"Asplund, Master. Clarence Gustaf Hugo",male,9.0,4,2,347077,31.3875,NaN,S,child,sehr teuer,0,Asplund,Asplund,A21453
261,262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.0,4,2,347077,31.3875,NaN,S,child,sehr teuer,0,Asplund,Asplund,A21453
244,245,0,3,"Attalah, Mr. Sleiman",male,30.0,0,0,2694,7.2250,NaN,C,"adult,male",billig,1,Attalah,Attalah,A34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
203,204,0,3,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,"adult,male",billig,1,Youseff,Youseff,Y21
354,355,0,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,<NA>,billig,1,Yousif,Yousif,Y21
495,496,0,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,<NA>,teuer,1,Yousseff,Yousseff,Y21
111,112,0,3,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,teenager,normal,0,Zabour,Zabour,Z16
240,241,0,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,<NA>,normal,0,Zabour,Zabour,Z16

In [39]:
(
    t.groupby(by=["Soundex", "Sex"])
    .filter(lambda g: g.shape[0] > 1)
    .sort_values(by=["Soundex", "Sex", "Ticket"])
    [["PassengerId","Name", "Soundex", "Ticket", "Cabin"]]
    .loc[lambda s: s["Soundex"]=='Y210']
)

Empty DataFrame
Columns: [PassengerId, Name, Soundex, Ticket, Cabin]
Index: []